'''
现在有一个未知列表a和一个空列表s,经过一系列变换之后,输出为 s=["1,"2","3,"4,"5"],

变换规则为:  a的一个元素插入s, a的下一个元素放到a列表最后再a的下一个元素放到s,再下一个元素放到a最后,
            一直到a变成一个空列表,最终s显示为刚才输出的那个样式,请写一个程序,打印出最开始a列表的顺序

例如:经过变换之后列表s = ["10","11","12"],则a = ["10","12","11"]
'''
a = ['1','5','2','4','3']
s = []

s.append(a.pop(0))
while len(a) != 0:
    a.append(a.pop(0))
    s.append(a.pop(0))

print(a,s)

a = []
s = ['1', '2', '3', '4', '5']

a.append(s.pop(0))
while len(s) != 0:
    s.insert(0,s.pop(len(s)-1))
    a.append(s.pop(0))
    a.append(s.pop(0))

print(a,s)
